Python 3.8.10 (tags/v3.8.10:3d8993a, May  3 2021, 11:34:34) [MSC v.1928 32 bit (Intel)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> print(7)
7
>>> a=input("Введите вид питомца")
Введите вид питомца12
>>> a=input("Введите вид питомца")
Введите вид питомца
>>> print ('Это', input("Введите вид питомца"),'по кличке"', input("Введите вид питомца"),'". Возраст:', input("Введите возраст питомца"), 'года' )
Введите вид питомцажелторотый питон
Введите вид питомцажелторотый питон
Введите возраст питомца34
Это желторотый питон по кличке" желторотый питон ". Возраст: 34 года
>>> print ('Это', input("Введите вид питомца"),'по кличке"', input("Введите кличку"),'". Возраст:', input("Введите возраст питомца"), 'года' )
Введите вид питомцажелторотый питон
Введите кличкуКаа
Введите возраст питомца34
Это желторотый питон по кличке" Каа ". Возраст: 34 года
>>> 